# Chicago Bike Infrastructure Project
<h3>Capstone Project for Data Analytics Certificate<br>
University of Texas<br><br>
Samantha Goodman
<br>December 2021</h3><br>
This notebook is part 4 of a 5 part series.<br>
       1 - Bike Shops from FourSquare API<br>
    2 - Bike Infrastructure<br>
        3 - Background information about neighborhoods<br>
        <b>4 - Analysis<br></b>
        5 - Model Building and Predictions<br><br>
    Questions this project aims to answer:<br>
    <ul><li>Which community areas (neighborhoods) have the most bike infrastructure, and which have the least?</li>
<li>Are there areas that show an unmet demand for bike infrastructure (higher rates of Divvy trips, but lower rates of bike lanes and repair shops)?</li>
<li>Can I predict bike infrastructure levels based on demographic or community health data?

In [75]:
# Import Libraries
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

First bike infrastructure data - see Notebook 2

In [76]:
# Import CSV to dataframe
# Source = City of Chicago data portal
neighborhoods = pd.read_csv('Chicago_community_areas.csv')
# Make all column names lowercase
neighborhoods.columns= neighborhoods.columns.str.lower()

In [77]:
neighborhoods.shape

(77, 3)

There are 77 official neighborhoods in Chicago. We will keep this number in mind when chekcing our datasets going forward.

# Find total street lengths for each neighborhood

This is a good way to metric to use when looking at length of bike lanes. Although we have the area of each neighborhood, some neighborhoods have large industrial sections without much city-owned infrastructure.

In [78]:
# Import CSV to dataframe
# Source = FourSquare, see 1-BikeShopsFromFourSquare notebook
streets = pd.read_csv('street_lengths_comm.csv')
# Make all column names lowercase
streets.columns= streets.columns.str.lower()

In [79]:
streets.head()

,class,date_creat,time_creat,create_use,dir_travel,edit_date,edit_type,ewns,ewns_coord,ewns_dir,...,l_f_add,l_fips,l_parity,l_t_add,l_zip,length,update_use,area_numbe,community,length_2
0,4,1999/01/01,00:00:00.000,EXISTING,F,0,NaN,-232,232,W,...,0,14000,O,0,60621.0,220.566014,EXISTING,68,ENGLEWOOD,67.227523
1,2,1999/01/01,00:00:00.000,EXISTING,B,0,NaN,0,0,NaN,...,7301,14000,O,7359,60619.0,664.774635,EXISTING,69,GREATER GRAND CROSSING,202.619640
2,4,1999/01/01,00:00:00.000,EXISTING,B,0,NaN,-2500,2500,W,...,10801,14000,O,10859,60655.0,665.378484,EXISTING,75,MORGAN PARK,202.805535
3,4,1999/01/01,00:00:00.000,EXISTING,B,0,NaN,-932,932,W,...,0,14000,O,0,60643.0,152.564889,EXISTING,75,MORGAN PARK,46.501185
4,4,1999/01/01,00:00:00.000,EXISTING,B,0,NaN,-11800,11800,S,...,1933,14000,O,1959,60643.0,332.691371,EXISTING,75,MORGAN PARK,101.403278

In [80]:
# Create a dataframe of grouped data by with length of all streets in each neighborhood
streets_grouped = pd.DataFrame(streets.groupby('community')['length_2'].sum().reset_index()).copy()
streets_grouped.head()

        community       length_2
0     ALBANY PARK   73723.820898
1  ARCHER HEIGHTS   52339.197584
2   ARMOUR SQUARE   59148.654592
3         ASHBURN  152829.703586
4  AUBURN GRESHAM  136022.586733

In [81]:
streets_grouped.sort_values('length_2')

         community       length_2
12        BURNSIDE   13591.225291
55         OAKLAND   19827.721142
36         KENWOOD   31479.439883
44       MONTCLARE   33779.597458
25     FULLER PARK   40480.268680
..             ...            ...
61        ROSELAND  168029.716438
75       WEST TOWN  188426.007579
56           OHARE  205033.967690
5           AUSTIN  232288.776880
49  NEAR WEST SIDE  232421.104766

[77 rows x 2 columns]

In [82]:
# Rename column to reflect that it's the number of shops
streets_grouped.columns = streets_grouped.columns.str.replace('length_2', 'length_streets_m')

# Sort descending by sum of street lengths, just to see
streets_grouped.sort_values(by=['length_streets_m'], inplace=True, ascending=False)

streets_grouped.head()

         community  length_streets_m
49  NEAR WEST SIDE     232421.104766
5           AUSTIN     232288.776880
56           OHARE     205033.967690
75       WEST TOWN     188426.007579
61        ROSELAND     168029.716438

Add street lengths to neighborhood database and rename as neighborhood_data

In [83]:
# Join neighborhoods and street length dataframes on the 'community' column
neighborhood_data = neighborhoods.merge(streets_grouped, how='left', on='community')

In [84]:
neighborhood_data.head()

   comm_num       community  area_kmsq  length_streets_m
0         1     ROGERS PARK  51.259902      57712.379599
1         2      WEST RIDGE  98.429095     121335.202892
2         3          UPTOWN  65.095643      63769.090382
3         4  LINCOLN SQUARE  71.352328      76974.128441
4         5    NORTH CENTER  57.054168      73743.375859

In [85]:
neighborhood_data.shape

(77, 4)

# Next up, add economic hardship data by neighborhood

In [86]:
# Import CSV to dataframe
# Source = City of Chicago Data Portal
# https://data.cityofchicago.org/Health-Human-Services/hardship-index/792q-4jtu
# Time Period: 2006-2010
hardship = pd.read_csv('hardship_data_community.csv')
# Make all column names lowercase
hardship.columns= hardship.columns.str.lower()

In [87]:
hardship.head()

,community area number,community area name,percent of housing crowded,percent households below poverty,percent aged 16+ unemployed,percent aged 25+ without high school diploma,percent aged under 18 or over 64,per capita income,hardship index
0,1.0,Rogers Park,7.7,23.6,8.7,18.2,27.5,23939,39.0
1,2.0,West Ridge,7.8,17.2,8.8,20.8,38.5,23040,46.0
2,3.0,Uptown,3.8,24.0,8.9,11.8,22.2,35787,20.0
3,4.0,Lincoln Square,3.4,10.9,8.2,13.4,25.5,37524,17.0
4,5.0,North Center,0.3,7.5,5.2,4.5,26.2,57123,6.0

In [88]:
# Sort descending by hardship index, just to see
hardship.sort_values(by=['hardship index'], inplace=True, ascending=True)
hardship.head()

,community area number,community area name,percent of housing crowded,percent households below poverty,percent aged 16+ unemployed,percent aged 25+ without high school diploma,percent aged under 18 or over 64,per capita income,hardship index
7,8.0,Near North Side,1.9,12.9,7.0,2.5,22.6,88669,1.0
6,7.0,Lincoln Park,0.8,12.3,5.1,3.6,21.5,71551,2.0
31,32.0,Loop,1.5,14.7,5.7,3.1,13.5,65526,3.0
5,6.0,Lake View,1.1,11.4,4.7,2.6,17.0,60058,5.0
4,5.0,North Center,0.3,7.5,5.2,4.5,26.2,57123,6.0

In [89]:
hardship.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 78 entries, 7 to 77
Data columns (total 9 columns):
 #   Column                                        Non-Null Count  Dtype
---  ------                                        --------------  -----
 0   community area number                         77 non-null     float64
 1   community area name                           78 non-null     object
 2   percent of housing crowded                    78 non-null     float64
 3   percent households below poverty              78 non-null     float64
 4   percent aged 16+ unemployed                   78 non-null     float64
 5   percent aged 25+ without high school diploma  78 non-null     float64
 6   percent aged under 18 or over 64              78 non-null     float64
 7   per capita income                             78 non-null     int64
 8   hardship index                                77 non-null     float64
dtypes: float64(7), int64(1), object(1)
memory usage: 6.1+ KB

In [90]:
# Drop the final row, which is Chicago averages
hardship = hardship.drop(77)

In [91]:
# Recast floats as ints
hardship['community area number'] = hardship['community area number'].astype(int)

In [92]:
# Join neighborhoods and street length dataframes on the 'community' column
neighborhood_data = neighborhood_data.merge(hardship, how='left', left_on='comm_num', right_on='community area number')

In [93]:
neighborhood_data.shape

(77, 13)

In [94]:
neighborhood_data.head()

,comm_num,community,area_kmsq,length_streets_m,community area number,community area name,percent of housing crowded,percent households below poverty,percent aged 16+ unemployed,percent aged 25+ without high school diploma,percent aged under 18 or over 64,per capita income,hardship index
0,1,ROGERS PARK,51.259902,57712.379599,1,Rogers Park,7.7,23.6,8.7,18.2,27.5,23939,39.0
1,2,WEST RIDGE,98.429095,121335.202892,2,West Ridge,7.8,17.2,8.8,20.8,38.5,23040,46.0
2,3,UPTOWN,65.095643,63769.090382,3,Uptown,3.8,24.0,8.9,11.8,22.2,35787,20.0
3,4,LINCOLN SQUARE,71.352328,76974.128441,4,Lincoln Square,3.4,10.9,8.2,13.4,25.5,37524,17.0
4,5,NORTH CENTER,57.054168,73743.375859,5,North Center,0.3,7.5,5.2,4.5,26.2,57123,6.0

In [95]:
# Drop extraneous community area columns
neighborhood_data.drop('community area number', axis=1, inplace=True)
neighborhood_data.drop('community area name', axis=1, inplace=True)
neighborhood_data.head()

,comm_num,community,area_kmsq,length_streets_m,percent of housing crowded,percent households below poverty,percent aged 16+ unemployed,percent aged 25+ without high school diploma,percent aged under 18 or over 64,per capita income,hardship index
0,1,ROGERS PARK,51.259902,57712.379599,7.7,23.6,8.7,18.2,27.5,23939,39.0
1,2,WEST RIDGE,98.429095,121335.202892,7.8,17.2,8.8,20.8,38.5,23040,46.0
2,3,UPTOWN,65.095643,63769.090382,3.8,24.0,8.9,11.8,22.2,35787,20.0
3,4,LINCOLN SQUARE,71.352328,76974.128441,3.4,10.9,8.2,13.4,25.5,37524,17.0
4,5,NORTH CENTER,57.054168,73743.375859,0.3,7.5,5.2,4.5,26.2,57123,6.0

In [96]:
# Save dataframe to CSV for use in analysis notebook
neighborhood_data.to_csv('neighborhood_data.csv')